In [94]:
import psycopg2
import pandas as pd

In [79]:
# Establish a connection to the database
conn = psycopg2.connect(
    dbname="INSTRUCTOR",
    user="postgres",
    password="1234",
    host="localhost",
    port="5432"  # Default PostgreSQL port
)

In [80]:
# Create a cursor object using the connection
cur = conn.cursor()

In [81]:
# Example: Create a table
cur.execute("""
CREATE TABLE IF NOT EXISTS instructor (
    id INTEGER PRIMARY KEY NOT NULL,
    fname VARCHAR(100),
    lname VARCHAR(100),
    city VARCHAR(100),
    ccode CHARACTER(2)
);
""")

In [82]:
# Commit the changes to the database
conn.commit()

In [ ]:

data_to_insert = [(2, "Matin","Kazemi","Hidaj","IR"), (3, "Amin","Kazemi","Hidaj","IR")]
cur.executemany("""
INSERT INTO instructor (id,fname,lname,city,ccode)
VALUES (%s,%s,%s,%s,%s)
""",data_to_insert)

In [84]:
# Commit the changes to the database
conn.commit()

In [85]:
# Example: Query data from the table
cur.execute("""SELECT * FROM instructor""")
rows = cur.fetchall()
for row in rows:
    print("ID:",row[0],"FirstName:",row[1],"LastName:",row[2],"City:",row[3],"CityCode:",row[4])

ID: 1 FirstName: Moein LastName: Kazemi City: Hidaj CityCode: IR
ID: 2 FirstName: Matin LastName: Kazemi City: Hidaj CityCode: IR
ID: 3 FirstName: Amin LastName: Kazemi City: Hidaj CityCode: IR

In [86]:
# Example: Update data in table
cur.execute("""UPDATE instructor SET fname = %s WHERE id = %s""",("Jackson",1))
conn.commit()

In [87]:
# Example: Query data from the table
cur.execute("""SELECT * FROM instructor""")
rows = cur.fetchall()
for row in rows:
    print("ID:",row[0],"FirstName:",row[1],"LastName:",row[2],"City:",row[3],"CityCode:",row[4])

ID: 2 FirstName: Matin LastName: Kazemi City: Hidaj CityCode: IR
ID: 3 FirstName: Amin LastName: Kazemi City: Hidaj CityCode: IR
ID: 1 FirstName: Jackson LastName: Kazemi City: Hidaj CityCode: IR

In [92]:
# Example: Delete data in table
cur.execute("""DELETE FROM instructor WHERE id = %s""",(1,))
conn.commit()

In [93]:
# Example: Query data from the table
cur.execute("""SELECT * FROM instructor""")
rows = cur.fetchall()
for row in rows:
    print("ID:",row[0],"FirstName:",row[1],"LastName:",row[2],"City:",row[3],"CityCode:",row[4])

ID: 2 FirstName: Matin LastName: Kazemi City: Hidaj CityCode: IR
ID: 3 FirstName: Amin LastName: Kazemi City: Hidaj CityCode: IR

In [95]:
# Retrieve data into Pandas
df = pd.read_sql_query("SELECT * FROM instructor",conn)
df

C:\Users\mkaze\AppData\Local\Temp\ipykernel_12220\3960729798.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM instructor",conn)

   id  fname   lname   city ccode
0   2  Matin  Kazemi  Hidaj    IR
1   3   Amin  Kazemi  Hidaj    IR

In [96]:
conn.close()